[
  {
    "name": "Infallible Relay",
    "desc": "<p> With this spell, you can target any creature with whom you have spoken previously, as long as the two of you are on the same plane of existence. When you cast the spell, the nearest functioning telephone or similar communications device within 100 feet of the target begins to ring. If there is no suitable device close enough to the target, the spell fails.\n\nThe target must make a successful Charisma saving throw or be compelled to answer your call. Once the connection is established, the call is crystal clear and cannot be dropped until the conversation has ended or the spell’s duration ends. You can end the conversation at any time, but a target must succeed on a Charisma saving throw to end the conversation.</p>",
    "range": "Self",
    "ritual": false,
    "duration": "10 minutes",
    "concentration": true,
    "casting_time": "1 minute",
    "level": 1,
    "school": "Divination",
    "class": [
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "level_desc": "1st-level",
    "class_desc": "Sorcerer, Warlock, Wizard",
    "range_desc": "Self",
    "component_desc": "V, S, M",
    "verbal": true,
    "material": true,
    "somatic": true,
    "source": "UA7MM",
    "page": 69,
    "material_desc": "a mobile phone",
    "material_cost": true
  },
  {
    "name": "Find Vehicle",
    "desc": "<p> You summon a spirit that assumes the form of a nonmilitary land vehicle of your choice, appearing in an unoccupied space within range. The vehicle has the statistics of a normal vehicle of its sort, though it is celestial, fey, or fiendish (your choice in origin). The physical characteristics of the vehicle reflect its origin to some degree. For example, a fiendish SUV might be jet black in color, with tinted windows and a sinister-looking front grille.\n\nYou have a supernatural bond with the conjured vehicle that allows you to drive beyond your normal ability. While driving the conjured vehicle, you are considered proficient with vehicles of its type, and you add double your proficiency bonus to ability checks related to driving the vehicle. While driving the vehicle, you can make any spell you cast that targets only you also target the vehicle.\n\nIf the vehicle drops to 0 hit points, it disappears, leaving behind no physical form. You can also dismiss the vehicle at any time as an action, causing it to disappear.\n\nYou can't have more than one vehicle bonded by this spell at a time. As an action, you can release the vehicle from its bond at any time, causing it to disappear.</p>",
    "range": "30 feet",
    "ritual": false,
    "duration": "8 hours",
    "concentration": false,
    "casting_time": "10 minutes",
    "level": 2,
    "school": "Conjuration",
    "class": [
      "Paladin",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "level_desc": "2nd-level",
    "class_desc": "Paladin, Sorcerer, Warlock, Wizard",
    "range_desc": "30 feet",
    "component_desc": "V, S",
    "verbal": true,
    "material": false,
    "somatic": true,
    "source": "UA7MM",
    "page": 69,
    "higher_level": "<p> When you cast this spell using a spell slot of 3rd level or higher, you can conjure a nonmilitary water vehicle large enough to carry six Medium creatures. When you cast this spell using a spell slot of 5th level or higher, you can conjure a nonmilitary air vehicle large enough to carry ten Medium creatures. When you cast this spell using a spell slot of 7th level or higher, you can conjure any type of vehicle, subject to the DM's approval.</p>"
  },
  {
    "name": "Synchronicity",
    "desc": "<p> The creature you touch feels reality subtly shifted to its favor while this spell is in effect. The target isn't inconvenienced by mundane delays of any sort. Traffic lights are always green, there's always a waiting elevator, and a taxi is always around the corner. The target can run at full speed through dense crowds, and attacks of opportunity provoked by the target's movement are made with disadvantage.\n\nSynchronicity grants advantage to Dexterity (Stealth) checks, since the target always finds a handy piece of cover available. Additionally, the target has advantage on all ability checks made to drive a vehicle.\n\nIn the event that two or more creatures under the effect of synchronicity are attempting to avoid being inconvenienced by each other, the creatures engage in a contest of Charisma each time the effects of the spells would oppose each other.</p>",
    "range": "Touch",
    "ritual": false,
    "duration": "Up to 1 hour",
    "concentration": true,
    "casting_time": "1 action",
    "level": 4,
    "school": "Enchantment",
    "class": [
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "level_desc": "4th-level",
    "class_desc": "Sorcerer, Warlock, Wizard",
    "range_desc": "Touch",
    "component_desc": "V, S",
    "verbal": true,
    "material": false,
    "somatic": true,
    "source": "UA7MM",
    "page": 69
  }
]