[
  {
    "name": "Snare",
    "desc": "<p> While you cast this spell, you use the cord or rope to create a circle with a 5-foot radius on a flat surface within your reach. When you finish casting, the cord or rope disappears to become a magical trap.\n\nThe trap is nearly invisible and requires a successful Intelligence (Investigation) check against your spell save DC to be found.\n\nThe trap triggers when a Small creature or larger moves into the area protected by the spell. The triggering creature must succeed on a Dexterity saving throw or fall prone and be hoisted into the air until it hangs upside down 3 feet above the protected surface, where it is restrained.\n\nThe restrained creature can make a Dexterity saving throw with disadvantage at the end of each of its turns and ends the restrained effect on a success. Alternatively, another creature that can reach the restrained creature can use an action to make an Intelligence (Arcana) check against your spell save DC. On a success, the restrained effect also ends.</p>",
    "range": "Touch",
    "ritual": false,
    "duration": "Until dispelled or triggered",
    "concentration": false,
    "casting_time": "1 minute",
    "level": 1,
    "school": "Abjuration",
    "class": [
      "Artificer,",
      "Druid,",
      "Ranger,",
      "Wizard"
    ],
    "level_desc": "1st-level",
    "class_desc": "Artificer,, Druid,, Ranger,, Wizard",
    "range_desc": "Touch",
    "component_desc": "V, S, M",
    "verbal": true,
    "material": true,
    "somatic": true,
    "source": "XGE",
    "page": 69,
    "material_desc": "30 feet of rope or cord",
    "material_cost": true
  },
  {
    "name": "Mind Spike",
    "desc": "<p> You reach into the mind of one creature you can see within range. The target must make a Wisdom saving throw, taking 3d8 psychic damage on a failed save, or half as much damage on a successful one. On a failed save, you also always know the target's location until the spell ends, but only while the two of you are on the same plane of existence. While you have this knowledge, the target can’t become hidden from you, and if it’s invisible, it gains no benefit from that condition against you.</p>",
    "range": "60 feet",
    "ritual": false,
    "duration": "Up to one hour",
    "concentration": true,
    "casting_time": "1 action",
    "level": 2,
    "school": "Divination",
    "class": [
      "Sorcerer,",
      "Warlock,",
      "Wizard"
    ],
    "level_desc": "2nd-level",
    "class_desc": "Sorcerer,, Warlock,, Wizard",
    "range_desc": "60 feet",
    "component_desc": "S",
    "verbal": false,
    "material": false,
    "somatic": true,
    "source": "XGE",
    "page": 69,
    "higher_level": "<p> When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.</p>"
  },
  {
    "name": "Tiny Servant",
    "desc": "<p> You touch one Tiny, nonmagical object that isn’t attached to another object or a surface and isn’t being carried by another creature. The target animates and sprouts little arms and legs, becoming a creature under your control until the spell ends or the creature drops to 0 hit points. Look up the stat block for its statistics.\n\nAs a bonus action, you can mentally command the creature if it is within 120 feet of you. (If you control multiple creatures with this spell, you can command any or all of them at the same time, issuing the same command to each one.) You decide what action the creature will take and where it will move during its next turn, or you can issue a simple, general command, such as to fetch a key, stand watch, or stack some books. If you issue no commands, the servant does nothing other than defend itself against hostile creatures. Once given an order, the servant continues to follow that order until its task is complete.\n\nWhen the creature drops to 0 hit points, it reverts to its original form, and any remaining damage carries over to that form.</p>",
    "range": "Touch",
    "ritual": false,
    "duration": "8 hours",
    "concentration": false,
    "casting_time": "1 minute",
    "level": 3,
    "school": "Transmutation",
    "class": [
      "Wizard",
      "Artificer"
    ],
    "level_desc": "3rd-level",
    "class_desc": "Wizard, Artificer",
    "range_desc": "Touch",
    "component_desc": "V, S",
    "verbal": true,
    "material": false,
    "somatic": true,
    "source": "XGE",
    "page": 69,
    "higher_level": "<p> When you cast this spell using a spell slot of 4th level or higher, you can animate two additional objects for each slot level above 3rd.</p>"
  },
  {
    "name": "Infestation",
    "desc": "<p> You cause a cloud of mites, fleas, and other parasites to appear momentarily on one creature you can see within range. The target must succeed on a Constitution saving throw, or it takes 1d6 poison damage and moves 5 feet in a random direction if it can move and its speed is at least 5 feet. Roll a d4 for the direction: 1, north; 2, south; 3, east; or 4, west. This movement doesn’t provoke opportunity attacks, and if the direction rolled is blocked, the target doesn't move.</p>",
    "range": "30 feet",
    "ritual": false,
    "duration": "Instantaneous",
    "concentration": false,
    "casting_time": "1 action",
    "level": 0,
    "school": "Conjuration",
    "class": [
      "Druid",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "level_desc": "Cantrip",
    "class_desc": "Druid, Sorcerer, Warlock, Wizard",
    "range_desc": "30 feet",
    "component_desc": "V, S, M",
    "verbal": true,
    "material": true,
    "somatic": true,
    "source": "XGE",
    "page": 69,
    "material_desc": "a living flea",
    "material_cost": true,
    "higher_level": "<p> The spell’s damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).</p>"
  },
  {
    "name": "Thunder Step",
    "desc": "<p> You teleport yourself to an unoccupied space you can see within range. Immediately after you disappear, a thunderous boom sounds, and each creature within 10 feet of the space you left must make a Constitution saving throw, taking 3d10 thunder damage on a failed save, or half as much damage on a successful one. The thunder can be heard from up to 300 feet away.\n\nYou can bring along objects as long as their weight doesn’t exceed what you can carry. You can also teleport one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell, and there must be an unoccupied space within 5 feet of your destination space for the creature to appear in; otherwise, the creature is left behind.</p>",
    "range": "90 feet",
    "ritual": false,
    "duration": "Instantaneous",
    "concentration": false,
    "casting_time": "1 action",
    "level": 3,
    "school": "Conjuration",
    "class": [
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "level_desc": "3rd-level",
    "class_desc": "Sorcerer, Warlock, Wizard",
    "range_desc": "90 feet",
    "component_desc": "V",
    "verbal": true,
    "material": false,
    "somatic": false,
    "source": "XGE",
    "page": 69,
    "higher_level": "<p> When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d10 for each slot level above 3rd.</p>"
  },
  {
    "name": "Sickening Radiance",
    "desc": "<p> Dim, greenish light spreads within a 30-foot-radius sphere centered on a point you choose within range. The light spreads around corners, and it lasts until the spell ends.\n\nWhen a creature moves into the spell’s area for the first time on a turn or starts its turn there, that creature must succeed on a Constitution saving throw or take 4d10 radiant damage, and it suffers one level of exhaustion and emits a dim, greenish light in a 5-foot radius. This light makes it impossible for the creature to benefit from being invisible. The light and any levels of exhaustion caused by this spell go away when the spell ends.</p>",
    "range": "120 feet",
    "ritual": false,
    "duration": "Up to 10 minutes",
    "concentration": true,
    "casting_time": "1 action",
    "level": 4,
    "school": "Evocation",
    "class": [
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "level_desc": "4th-level",
    "class_desc": "Sorcerer, Warlock, Wizard",
    "range_desc": "120 feet",
    "component_desc": "V, S",
    "verbal": true,
    "material": false,
    "somatic": true,
    "source": "XGE",
    "page": 69
  }
]